Revit 2026 API

# LineLoadSetPoints Method

---

Sets start and end point of the line load.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool SetPoints(
	XYZ startPoint,
	XYZ endPoint
)
```
```vb
Public Function SetPoints (
	startPoint As XYZ,
	endPoint As XYZ
) As Boolean
```
```cpp
public:
bool SetPoints(
	XYZ^ startPoint,
	XYZ^ endPoint
)
```
```fsharp
member SetPoints :
        startPoint : XYZ *
        endPoint : XYZ -> bool
```

#### Parameters

startPoint XYZ
     The start point.
endPoint XYZ
     The end point.

#### Return Value

Boolean Returns true if successful, false otherwise.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the end point is equal to the start point. |
| ArgumentNullException | A non-optional argument was null |
| InvalidOperationException | This LineLoad is not a hosted load. -or- This LineLoad is a constrained load. |

This method works with hosted line load only. This method works for loads which are not constrained to their host. The curve of the resulted load will be a line.

#### Reference

LineLoad Class

Autodesk.Revit.DB.Structure Namespace